#include <iostream>
using namespace std;

int main()
{
	setlocale(0, "");
	string month[12] = { "января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря" };

	string day[31] = { "первое","второе", "третье", "четвёртое", "пятое", "шестое", "седьмое", "восьмое", "девятое","десятое", "одиннадцатое", "двенадцатое", "тринадцатое",
                     "четырнадцатое", "пятнадцатое", "шестнадцатое", "семнадцатое", "восемнадцатое", "девятнадцатое", "двадцатое", "двадцать первое","двадцать второе", 
                     "двадцать третье", "двадцать четвёртое", "двадцать пятое", "двадцать шестое","двадцать седьмое", "двадцать восьмое", "двадцать девятое", "тридцатое", 
                     "тридцать первое"};
	
	int a, b;

	cout << "Введите номер дня и месяца: \n";
	cin >> a >> b;
	cout << day[a-1] << " " << month[b-1];

	return 0;
}