#include <iostream>
using namespace std;

int main()
{
	setlocale(0, "");
	int N;
	string x;

	string ed[9] = { "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять" };

	string des[9] = { "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};

	string sot[9] = { "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот" };

	string iskl[9] = { "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать" };
	
	cout << "Введите число: ";
	cin >> N;

	if ((N - N / 100 * 100 <= 10) or (N - N / 100 * 100 >= 20))
	{
		x = sot[N / 100 - 1];
		if (N % 100 - N % 10 != 0)
			x = x + " " + des[N / 10 % 10 - 1];
		if (N % 10 != 0)
			x = x + " " + ed[N % 10 - 1];
	}
	else x = sot[N / 100 - 1] + " " +iskl[N % 10 - 1];
	
	cout << x;

	return 0;
}